/*Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

452 -> 11

82 -> 10

9012 -> 12*/

int[] massive;
Console.WriteLine("Введите длину массива");
int dlina = Convert.ToInt32(Console.ReadLine());
int create_massive(string number)
{
        for (int i = 0; i < dlina; i++)
    {
        Console.Write($" {array[i]} ");
    }
    return Array[i];
}
Console.WriteLine(create_massive(1, 2, 3, 4, 5, 6, 7, 8));